---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings
source: html/a0362ecb-2442-6371-7e89-7a9ba66a0466.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings

Contains legend settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayLegendSettings : IDisposable
```